Table: Person

+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| id          | int     |
| email       | varchar |
+-------------+---------+
id is the primary key (column with unique values) for this table.
Each row of this table contains an email. The emails will not contain uppercase letters.
 

Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.

For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.

For Pandas users, please note that you are supposed to modify Person in place.

After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

The result format is in the following example.

 

Example 1:

Input: 
Person table:
+----+------------------+
| id | email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |
+----+------------------+
Output: 
+----+------------------+
| id | email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
+----+------------------+
Explanation: john@example.com is repeated two times. We keep the row with the smallest Id = 1.b

In [1]:
import pandas as pd

def delete_duplicate_emails(person: pd.DataFrame) -> pd.DataFrame:
    person.set_index('id', inplace = True)
    person.sort_index(inplace=True)
    person.drop_duplicates(subset = ['email'], inplace = True)
    person.reset_index(inplace = True)
    return person

In [2]:
data = [[3, 'john@example.com'], [2, 'bob@example.com'], [1, 'john@example.com']]
df1 = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'int64', 'email':'object'})

In [3]:
df1

   id             email
0   3  john@example.com
1   2   bob@example.com
2   1  john@example.com

In [4]:
df1.set_index('id', inplace = True)
df1

               email
id
3   john@example.com
2    bob@example.com
1   john@example.com

In [5]:
df1.sort_index(inplace = True)
df1

               email
id
1   john@example.com
2    bob@example.com
3   john@example.com

In [6]:
df1.drop_duplicates(subset = ['email'], inplace = True)
df1

               email
id
1   john@example.com
2    bob@example.com

In [7]:
df1.reset_index(inplace = True)
df1

   id             email
0   1  john@example.com
1   2   bob@example.com

In [8]:
data = [[3, 'john@example.com'], [2, 'bob@example.com'], [1, 'john@example.com']]
df1 = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'int64', 'email':'object'})

In [9]:
delete_duplicate_emails(person=df1)

   id             email
0   1  john@example.com
1   2   bob@example.com